{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 32, "name": "conv2d_1", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "batch_input_shape": [null, 28, 28, 1]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "filters": 32, "name": "conv2d_2", "padding": "same", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "padding": "same", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "filters": 64, "name": "conv2d_3", "padding": "same", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "filters": 64, "name": "conv2d_4", "padding": "same", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "padding": "same", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 1024, "use_bias": true, "activation": "relu", "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 512, "use_bias": true, "activation": "relu", "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_4", "seed": null, "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 10, "use_bias": true, "activation": "softmax", "name": "dense_3", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null}}], "keras_version": "2.1.5", "backend": "tensorflow"}